In [6]:
lado_cozinha = 5

def areaQuadrado(lado):
    area = lado ** 2
    return area

In [7]:
area_cozinha = areaQuadrado(lado_cozinha)
print(area_cozinha)

25

In [8]:
area_cozinha = lambda lado: lado ** 2

print(area_cozinha(5))

25

In [ ]:
Criar uma função lambda que calcule a área de um triângulo
area = base x altura / 2

In [9]:
area_triangulo = lambda base, altura : (base * altura) / 2
print(area_triangulo(5,8))

20.0

In [10]:
lados= [5, 6, 8, 4, 9]

areas = list(map(lambda lado : lado ** 2, lados))

print(areas)

[25, 36, 64, 16, 81]

In [14]:
# Utilizando o map e lambda crie uma nova lista com as áreas
# dos triângulos baseados nas duas listas abaixo
# area = base * altura / 2
bases = [2, 4, 6, 8, 10]
alturas = [3, 6, 9, 12, 15]

# Crie uma nova lista com os resultados das potenciações das listas abaixo
bs = [2, 5, 7, 6, 10]
expoentes = [3, 2, 2, 5, 2]

In [12]:
areas_triangulos = list(map(lambda base, altura : (base * altura) / 2, bases, alturas))
print(areas_triangulos)

[3.0, 12.0, 27.0, 48.0, 75.0]

In [15]:
potenciacoes = list(map(lambda base, expoente: base ** expoente, bs, expoentes))
print(potenciacoes)

[8, 25, 49, 7776, 100]

In [16]:
lista2 = [x for x in range(100)]
print(lista2)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99]

In [17]:
animais = ['zebra', 'cachorro', 'gato', 'girafa', 'golfinho']
lista_a = [x for x in animais if 'a' in x]
print(lista_a)

['zebra', 'cachorro', 'gato', 'girafa']

In [21]:
import pandas as pd

lista_serie = [1, 5, 6, 9, 7]
serie = pd.Series(lista_serie)
display(serie)

print(serie.ndim) # número de dimensões

0    1
1    5
2    6
3    9
4    7
dtype: int64

1

In [26]:
print(serie.info())
print(serie.sum())
print(serie.mean())
print(serie.median())
print(serie.describe())

<class 'pandas.core.series.Series'>
RangeIndex: 5 entries, 0 to 4
Series name: None
Non-Null Count  Dtype
--------------  -----
5 non-null      int64
dtypes: int64(1)
memory usage: 168.0 bytes
None
28
5.6
6.0
count    5.000000
mean     5.600000
std      2.966479
min      1.000000
25%      5.000000
50%      6.000000
75%      7.000000
max      9.000000
dtype: float64

In [28]:
dicio = {'coluna1': [x for x in range(200) if x % 2 == 0], 'coluna2': list(range(0, 100)), 'coluna3': 
         list(map(lambda x: x ** 2, range(0,100)))}

dicio_2 = pd.DataFrame(dicio)
display(dicio_2)

    coluna1  coluna2  coluna3
0         0        0        0
1         2        1        1
2         4        2        4
3         6        3        9
4         8        4       16
..      ...      ...      ...
95      190       95     9025
96      192       96     9216
97      194       97     9409
98      196       98     9604
99      198       99     9801

[100 rows x 3 columns]

In [32]:
print(dicio_2['coluna1'])

0       0
1       2
2       4
3       6
4       8
     ...
95    190
96    192
97    194
98    196
99    198
Name: coluna1, Length: 100, dtype: int64

In [39]:
print(dicio_2.ndim)
print('\n')
print(dicio_2.sum())
print('\n')
print(dicio_2.mean())
print('\n')
print(dicio_2.max())
print('\n')
print(dicio_2.describe())

2


coluna1      9900
coluna2      4950
coluna3    328350
dtype: int64


coluna1      99.0
coluna2      49.5
coluna3    3283.5
dtype: float64


coluna1     198
coluna2      99
coluna3    9801
dtype: int64


          coluna1     coluna2      coluna3
count  100.000000  100.000000   100.000000
mean    99.000000   49.500000  3283.500000
std     58.022984   29.011492  2968.174804
min      0.000000    0.000000     0.000000
25%     49.500000   24.750000   612.750000
50%     99.000000   49.500000  2450.500000
75%    148.500000   74.250000  5513.250000
max    198.000000   99.000000  9801.000000

In [45]:
dic = {'Matricula': [1111, 2222, 3333, 4444, 5555], 'Nome': ['João das Neves', 'Joana Darc', 'Leia', 'Marcos', 'Miguel A.'],
      'Idade': [18, 19, 18, 28, 26], 'Curso': ['Metaverso', 'Dev Fullstack', 'Dev Fullstack', 'Fotografia', 'Design']}

dt = pd.DataFrame(dic)
dt.f
left_aligned_df = dt.style.set_properties(**{'text-align': 'left'})
display(left_aligned_df)
# display(dt)

In [63]:
players = pd.read_csv('Players.csv')
players.rename(columns= {players.isnull().any().any():'Código','Player': 'Players'}, inplace=True)
display(players)

,Unnamed: 0,Players,height,weight,collage,born,birth_city,birth_state
0,0,Curly Armstrong,180.0,77.0,Indiana University,1918.0,NaN,NaN
1,1,Cliff Barker,188.0,83.0,University of Kentucky,1921.0,Yorktown,Indiana
2,2,Leo Barnhorst,193.0,86.0,University of Notre Dame,1924.0,NaN,NaN
3,3,Ed Bartels,196.0,88.0,North Carolina State University,1925.0,NaN,NaN
4,4,Ralph Beard,178.0,79.0,University of Kentucky,1927.0,Hardinsburg,Kentucky
...,...,...,...,...,...,...,...,...
3917,3917,Troy Williams,198.0,97.0,South Carolina State University,1969.0,Columbia,South Carolina
3918,3918,Kyle Wiltjer,208.0,108.0,Gonzaga University,1992.0,Portland,Oregon
3919,3919,Stephen Zimmerman,213.0,108.0,"University of Nevada, Las Vegas",1996.0,Hendersonville,Tennessee
3920,3920,Paul Zipser,203.0,97.0,NaN,1994.0,Heidelberg,Germany
3921,3921,Ivica Zubac,216.0,120.0,NaN,1997.0,Mostar,Bosnia and Herzegovina